_posts/2012-05-17-using-python-with-emacs.html
---
layout: post
title: Using Python with Emacs
excerpt: A first taste of turning a text editor into an IDE.
---


<p>
After trying to build my website using HTML, PHP, and the Bluefish Editor for a while, I decided to learn to use a modern web application framework. Of the two popular choices I know of, Django and Ruby-on-Rails, I chose Django because I am more familiar with Python than Ruby.
</p>

<p>
I also decided to learn to use Emacs as a secondary goal. Many individuals on StackOverflow suggest that spending time and effort to master a text editor such as Vim or Emacs is a sound investment. At first, I was skeptical. Aren't powerful, feature-rich IDE's such as Visual Studio and Eclipse more capable of helping me write code? Emacs is around 35 years old, and I'm wary of software 15 years older than me.
</p>

<p>
Without a doubt, it's very frustrating to get started with Emacs. What's all this about <i>points</i> and <i>buffers</i>? How do I set up a Python REPL? Can I get the nifty auto-completion that Eclipse provides?
</p>

<p>
The problem was that I kept thinking of Emacs as <i>just</i> a text editor, akin to Notepad. It's better to think of it as an easily customizable and extensible tool that requires the user to tell it what to do.
</p>

<p>
<a href="http://www.yilmazhuseyin.com/">Huseyin Yilmaz</a> has written a three-part tutorial on how to configure Emacs, get it to run Python, and work with HTML and such. I followed his tutorial, and therefore won't repeat anything here.
</p>

<ol class="org-ol">
<li><a href="http://www.yilmazhuseyin.com/blog/dev/basic-emacs-setup/">Basic Emacs setup</a>
</li>
<li><a href="http://www.yilmazhuseyin.com/blog/dev/emacs-setup-python-development/">Emacs setup for Python development</a>
</li>
<li><a href="http://www.yilmazhuseyin.com/blog/dev/emacs-setup-web-development/">Emacs setup for web development</a>
</li>
</ol>

<p>
I will, however, give brief descriptions of the components I used, if only so I'll remember what they do.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Basic Emacs setup tools</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/InteractivelyDoThings">IDO</a>
<ul class="org-ul">
<li>Stands for "Interactive Do". Tool that allows for quick directory and buffer switching, as well as quick file search. It's built-in for Emacs 23, so there's no need to install it separately.
</li>
</ul>
</li>
<li><a href="http://cx4a.org/software/auto-complete/index.html">Autocomplete mode</a>
<ul class="org-ul">
<li>Tool that provides autocompletion for Emacs.
</li>
</ul>
</li>
<li><a href="http://www.nongnu.org/color-theme/#sec5">Color themes</a>
<ul class="org-ul">
<li>Color themes for Emacs. I prefer the Bharadwaj theme. Use <code>M-x, color-theme-bharadwaj</code> to select it.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Emacs setup for Python development tools</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://pymacs.progiciels-bpi.ca/index.html">pymacs</a>
<ul class="org-ul">
<li>Python binding for Emacs. Can be installed separately, or from Fedora repository using <code>sudo yum install emacs-pymacs</code>.
</li>
</ul>
</li>
<li><a href="http://rope.sourceforge.net/">rope</a>
<ul class="org-ul">
<li>Python refactoring library, not specific to Emacs.
</li>
</ul>
</li>
<li><a href="http://pypi.python.org/pypi/ropemode">rope-mode</a>
<ul class="org-ul">
<li>Minor mode for Ropemacs.
</li>
</ul>
</li>
<li><a href="http://rope.sourceforge.net/ropemacs.html">ropemacs</a>
<ul class="org-ul">
<li>Rope bindings for Emacs. <code>pymacs</code>, <code>rope</code>, and <code>rope-mode</code> should be installed before <code>ropemacs</code>.
</li>
</ul>
</li>
<li><a href="http://flymake.sourceforge.net/">flymake</a>
<ul class="org-ul">
<li>On-the-fly syntax checker for Emacs. Not specific to Python. Needs <code>pyflakes</code> or some other tool to work.
</li>
</ul>
</li>
<li><a href="http://www.plope.com/Members/chrism/flymake-mode">flymake-mode</a>
<ul class="org-ul">
<li>Minor mode for <code>flymake</code>
</li>
</ul>
</li>
<li><a href="http://pypi.python.org/pypi/pyflakes">pyflakes</a>
<ul class="org-ul">
<li>Passive checker for Python programs.
</li>
</ul>
</li>
</ul>

<p>
I have not tried any of the Emacs setup for web development tools yet. I'll provide updates if and when I try them.
</p>
</div>
</div>
